In [41]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
import csv

In [42]:
#Load Dataset From CSV
data=pd.read_csv('HousingData.csv')
data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,NaN,36.2

In [43]:
#Find the Columns containing null values and Number of Null fields in them.
data.isnull().sum()

CRIM       20
ZN         20
INDUS      20
CHAS       20
NOX         0
RM          0
AGE        20
DIS         0
RAD         0
TAX         0
PTRATIO     0
B           0
LSTAT      20
MEDV        0
dtype: int64

In [12]:
#Null values can be filled in following ways:-

In [13]:
#Method 1:

In [44]:
#Fill using mean value of that column
print(data['CRIM'].mean())
#Fill the mean value in place of all Null values
data['CRIM']=data['CRIM'].fillna(data['CRIM'].mean())
data.isnull().sum()

3.6118739711934156

CRIM        0
ZN         20
INDUS      20
CHAS       20
NOX         0
RM          0
AGE        20
DIS         0
RAD         0
TAX         0
PTRATIO     0
B           0
LSTAT      20
MEDV        0
dtype: int64

In [15]:
#Method 2:

In [45]:
#Fill using median value of that column
print(data['ZN'].median())
#Fill the median value in place of all Null values
data['ZN']=data['ZN'].fillna(data['ZN'].median())
data.isnull().sum()

0.0

CRIM        0
ZN          0
INDUS      20
CHAS       20
NOX         0
RM          0
AGE        20
DIS         0
RAD         0
TAX         0
PTRATIO     0
B           0
LSTAT      20
MEDV        0
dtype: int64

In [20]:
#Method 3:

In [46]:
#Fill using a random value produced between max and min value of that column
print(data['INDUS'].max())
print(data['INDUS'].min())
#Find Random value in between min and max of INDUS Column
import random
randomNumber = random.uniform(data['INDUS'].min(), data['INDUS'].max())
#Fill the random value in place of all Null values
data['INDUS']=data['INDUS'].fillna(randomNumber)
data.isnull().sum()

27.74
0.46

CRIM        0
ZN          0
INDUS       0
CHAS       20
NOX         0
RM          0
AGE        20
DIS         0
RAD         0
TAX         0
PTRATIO     0
B           0
LSTAT      20
MEDV        0
dtype: int64

In [31]:
#Method 4:

In [47]:
#Fill using value taken in input
x=int(input("Please give a number"))
#Fill the median value in place of all Null values
data['CHAS']=data['CHAS'].fillna(x)
data.isnull().sum()

Please give a number10

CRIM        0
ZN          0
INDUS       0
CHAS        0
NOX         0
RM          0
AGE        20
DIS         0
RAD         0
TAX         0
PTRATIO     0
B           0
LSTAT      20
MEDV        0
dtype: int64

In [33]:
#Method 5:

In [48]:
#Remove the column containg Null values
data=data.drop('AGE',axis=1)
data.isnull().sum()

CRIM        0
ZN          0
INDUS       0
CHAS        0
NOX         0
RM          0
DIS         0
RAD         0
TAX         0
PTRATIO     0
B           0
LSTAT      20
MEDV        0
dtype: int64

In [36]:
#Method 6:

In [51]:
#Remove the rows containing Null values
data=data.dropna()
data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,4.0900,1,296,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,6.0622,3,222,18.7,394.63,2.94,33.4
5,0.02985,0.0,2.18,0.0,0.458,6.430,6.0622,3,222,18.7,394.12,5.21,28.7